print("Здравствуйте! Это калькулятор.") # приветствие и интструкции
print("Введите через пробел: число, операцию, которую нужно совершить над ним, второе число. Пример: 2 * 2.")
print("Доступные операции:\n- сложение (поставьте между числами знак +)\n- вычитание (поставьте между числами знак -)\n- умножение (поставьте между числами знак *)\n- деление (поставьте между числами знак :)")
print("")

user_input = input("Введите числа и необходимую операцию: ").split()  # пользователь вводит данные, из них создается
# список
number1, operation, number2 = user_input  # присваиваем переменным
number1, number2 = int(number1), int(number2)  # делаем из строчных элементов числа

def calculate(number1 , number2, operation):  # создаем функцию
    if operation == "+":  # если пользователь ввел "+", то числа складываются
        result = number1 + number2  # результат
    elif operation == "-":  # если пользователь ввел "-", то из первого числа вычитается второе
        result = number1 - number2  # результат
    elif operation == "*":  # если пользователь ввел "*", то числа умножаются
        result = number1 * number2  # результат
    elif operation == ":":  # если пользователь ввел ":", то первое число делится на второе
        result = number1 / number2  # результат
    else:  # если пользователь ввел что-то другое между двумя числами, то результатом является строка
        result = "Неизвестная операция"  # результат
    return result  # результат возвращается функцией

print(calculate(number1, number2, operation))  # выводим в консоль результат работы запущенной функции